Autodesk.Navisworks.Api.IHasDynamicProperties
Extends the NET interface System.Dynamic.IDynamicMetaObjectProvider to include provision of dynamic properties.

Autodesk.Navisworks.Api.IHasDynamicProperties.DynamicMemberNames
Enumerates the dynamically added members of the object by name.

Autodesk.Navisworks.Api.IHasDynamicProperties.GetProperty(System.String)
Fetches the property value specified by the string argument.
name:
Name of the dynamic property to obtain. As with real NET properties, this name is case-sensitive.
Returns:
Value of the dynamic property retrieved.
Throws System.ArgumentException: Name is not a valid dynamic property.

Autodesk.Navisworks.Api.IHasDynamicProperties.SetProperty(System.String,System.Object)
Sets a value to the property specified by the string argument.
name:
Name of the dynamic property to set. As with real NET properties, this name is case-sensitive.
value:
Value to set. This should match the type of the dynamic property.
Returns:
The same object as was passed to argument 'value'. This enables settor chaining.
Throws System.ArgumentException: Name is not a valid dynamic property.
Throws System.InvalidCastException: Value does not cast to the expected dynamic property type.
Throws System.NotSupportedException: Setting to the property is not supported.